package com.knubisoft.chapter_2_arrays.array.procedure;

public class ProcedureArray {
    public static void main(String[] args) {
        long[] arr; // ссылка на массив
        arr = new long[100]; // создание массива
        int nElems = 0; // количество элементов
        int j; // счетчик цикла
        long searchKey; // ключ искомого элемента
//---------------------------------------------------------------------------------------------------------------------
        arr[0] = 77; // вставка 10ти элементов
        arr[1] = 99;
        arr[2] = 44;
        arr[3] = 55;
        arr[4] = 22;
        arr[5] = 88;
        arr[6] = 11;
        arr[7] = 00;
        arr[8] = 66;
        arr[9] = 33;
        nElems = 10; // массив содержит 10 элементов
//---------------------------------------------------------------------------------------------------------------------
        for (j = 0; j < nElems; j++)  // Вывод элементов массива
            System.out.print(arr[j] + " ");
//---------------------------------------------------------------------------------------------------------------------
        searchKey = 66;                                         // поиск элемента с ключом 66
        System.out.println("\nTry to find " + searchKey);
        for (j = 0; j < nElems; j++)                            // цикл по всему массиву
            if (arr[j] == searchKey)                            // проверяем найдено ли значение?
                break;                                          // если да - выходим из цикла
        if(j == nElems)                                         // если мы дошли в цикле до последнего элемента
            System.out.println("Can't find " + searchKey);    // значит не нашли нужный элемент
        else                                                    // если не дошли
            System.out.println("Found: " + searchKey);          // нашли нужный элемент
// ---------------------------------------------------------------------------------------------------------------------
        searchKey = 55;                         // удаление элемента с ключом 55
        System.out.println("Delete: " + searchKey);
        for (j = 0; j < nElems; j++)            // цикл по всему массиву
            if (arr[j] == searchKey)
                break;                          // нашли
        for (int k = j; k < nElems - 1; k++)    // сдвиг следующих элементов
            arr[k] = arr[k + 1];
        nElems--;                               // уменьшение размера всего массива
//---------------------------------------------------------------------------------------------------------------------
        for (j = 0; j < nElems; j++)            // вывод элементов массива
            System.out.print(arr[j] + " ");
    }
}
